disturbance
turbulence
turmoil
unrest
upheaval
calm
harmony
order
peace
tranquility
acrimony
animosity
annoyance
antagonism
displeasure
enmity
exasperation
fury
hatred
impatience
indignation
ire
irritation
outrage
passion
rage
resentment
temper
violence
calm
calmness
cheer
comfort
delight
ease
glee
good will
happiness
joy
kindness
liking
love
peace
pleasure
annoyed
bitter
enraged
exasperated
furious
heated
impassioned
indignant
irate
irritable
irritated
offended
outraged
resentful
sullen
uptight
calm
happy
mild
peaceful
pleased
callous
indifferent
laid-back
passive
stoic
uninterested
caring
compassionate
concerned
feeling
interested
sympathetic
craving
demand
fondness
greed
hunger
inclination
longing
lust
passion
penchant
propensity
stomach
taste
thirst
weakness
willingness
yearning
zeal
zest
apathy
disinclination
dislike
hate
hatred
indifference
lethargy
criticism
absorption
combination
consolidation
division
parting
separation
severance
covet
cry out for
fancy
lust after
demanding
contingency
vicissitude
howl
lament
sob
laugh
crestfallen
depressed
dismayed
pessimistic
encouraged
antipathy
aversion
dislike
distaste
hatred
loathing
repulsion
revulsion
approval
liking
love
loving
inattention
indifference
lethargy
animosity
animus
antagonism
antipathy
aversion
disapproval
disgust
displeasure
dissatisfaction
distaste
enmity
hatred
hostility
loathing
prejudice
admiration
approval
desire
esteem
fondness
friendship
good will
happiness
kindness
liking
love
loving
pleasure
regard
respect
satisfaction
sympathy
crestfallen
depressed
despondent
disheartened
glum
cheerful
elated
encouraged
happy
anger
annoyance
disapproval
dislike
dissatisfaction
distaste
indignation
irritation
pique
resentment
umbrage
unhappiness
approval
happiness
joy
liking
love
pleasure
annoyance
anxiety
boredom
complaint
disappointment
disapproval
discomfort
discontent
dismay
displeasure
disquiet
distaste
exasperation
frustration
irritation
regret
resentment
uneasiness
unhappiness
weariness
worry
approval
assurance
calm
calmness
comfort
composure
contentedness
delight
ease
encouragement
happiness
love
peace
pleasure
sanction
satisfaction
antipathy
aversion
disgust
dislike
displeasure
dissatisfaction
hate
hatred
horror
hostility
loathing
repulsion
revulsion
admiration
delight
esteem
fondness
happiness
kindness
liking
love
loving
pleasure
respect
satisfaction
sympathy
bankruptcy
breakdown
collapse
decline
defeat
deficiency
deterioration
failing
loss
misstep
betterment
improvement
increase
rise
success
win
lethargy
weakness
weariness
convicted
culpable
liable
remorseful
responsible
sorry
wrong
good
immune
irresponsible
right
afraid
averse
doubtful
halting
indecisive
loath
reluctant
shy
skeptical
slow
tentative
timid
unsure
unwilling
believing
bold
brave
certain
confident
decisive
definite
eager
extroverted
fearless
ready
sure
willing
desperate
forlorn
helpless
impossible
pointless
sad
tragic
useless
cheerful
good
happy
hopeful
joyful
doubtful
hesitant
tentative
wishy-washy
certain
definite
sure
alienation
apathy
callousness
carelessness
disdain
disinterest
disregard
inattention
inertia
insensitivity
lack
negligence
nonchalance
attention
esteem
respect
inconsequential
infinitesimal
irrelevant
meager
meaningless
minimal
minor
minuscule
negligible
paltry
pointless
senseless
trivial
unimportant
big
huge
important
large
major
meaningful
relevant
sensible
significant
substantial
useful
valuable
worthwhile
restlessness
irritation
annoyed
contentious
exasperated
fractious
petulant
prickly
resentful
surly
testy
happy
pleasant
assassination
bloodshed
carnage
homicide
manslaughter
massacre
slaughter
slaying
birth
apathy
inertia
lethargy
negligence
sloth
weariness
activity
life
liveliness
apathetic
careless
dull
inattentive
indifferent
lackadaisical
lethargic
passive
sleepy
tired
weary
activated
active
attentive
careful
caring
concerned
energetic
fresh
interested
lively
vivacious
cynicism
despair
distrust
gloom
grief
hopelessness
melancholy
sadness
unhappiness
cheer
confidence
faith
happiness
joy
joyfulness
trust
absurd
aimless
fruitless
futile
impotent
inconsequential
ineffective
ineffectual
insignificant
irrelevant
meaningless
powerless
silly
stupid
trivial
unnecessary
unproductive
useless
worthless
able
consequential
effective
fruitful
important
necessary
potent
productive
profitable
sensible
significant
strong
useful
valuable
wise
worthwhile
abuse
beating
discipline
forfeiture
retribution
sanction
suffering
torture
trial
award
happiness
reward
agitated
anxious
disturbed
edgy
fidgety
itchy
nervous
restive
sleepless
troubled
uneasy
unruly
unsettled
calm
collected
composed
content
cool
easygoing
laid-back
peaceful
quiet
relaxed
settled
unworried
anguish
grief
heartache
heartbreak
hopelessness
melancholy
misery
mourning
poignancy
sorrow
cheer
delight
happiness
joy
sexuality
coma
dream
hibernation
slumber
trance
consciousness
wakefulness
dangerous
deadly
depressed
destructive
fatal
lethal
harmless
healthful
helpful
life-giving
wholesome
fatigue
weariness
afraid
anxious
apprehensive
hesitant
shaky
touchy
troubled
unsure
uptight
at ease
calm
certain
collected
composed
cool
definite
happy
peaceful
quiet
sure
unafraid
unwavering
unworried
depressed
despondent
miserable
not happy
sorry
cheerful
elated
happy
hopeful
joyful
barren
bogus
futile
inconsequential
ineffective
insignificant
meaningless
mediocre
pointless
unimportant
unproductive
unprofitable
unusable
useless
beneficial
fruitful
helpful
important
meaningful
productive
profitable
significant
useful
valuable
worthwhile
agitation
anger
angry
apathetic
appetite
blame
concentration
crave
critical
criticalness
cry
disconcerted
discouraged
disgust
disinterest
dislike
dispirited
displeasure
dissatisfaction
distaste
failure
fatigue
guilty
hesitant
hopeless
indecisive
indecisiveness
indifference
insignificant
insomnia
irritability
irritable
killing
laziness
lazy
pessimism
pointless
punishment
repulsion
restless
sadness
self
sex
sleep
suicidal
suicide
tiredness
unconfident
unhappy
worthless
worthlessness
