disturbance
turbulence
turmoil
unrest
upheaval
commotion
discomposure
stirring
tizzy
churning
rocking
tossing
acrimony
animosity
annoyance
antagonism
displeasure
enmity
exasperation
fury
hatred
impatience
indignation
ire
irritation
outrage
passion
rage
resentment
temper
violence
chagrin
choler
conniption
dander
disapprobation
distemper
gall
huff
infuriation
irascibility
irritability
miff
peevishness
petulance
pique
rankling
soreness
stew
storm
tantrum
tiff
umbrage
vexation
blow up
cat fit
hissy fit
ill humor
ill temper
slow burn
annoyed
bitter
enraged
exasperated
furious
heated
impassioned
indignant
irate
irritable
irritated
offended
outraged
resentful
sullen
uptight
affronted
antagonized
chafed
choleric
convulsed
cross
displeased
exacerbated
ferocious
fierce
fiery
fuming
galled
hateful
hot
huffy
ill-tempered
incensed
inflamed
infuriated
irascible
ireful
maddened
nettled
piqued
pissed
pissed off
provoked
put out
raging
riled
sore
splenetic
storming
sulky
vexed
wrathful
callous
indifferent
laid-back
passive
stoic
uninterested
blah
cold
cool
could care less
couldn't care less
don't give a damn
draggy
emotionless
flat
impassive
insensible
languid
moony
stolid
unconcerned
unemotional
unfeeling
unmoved
unresponsive
untouched
what the hell
wimpy
craving
demand
fondness
greed
hunger
inclination
longing
lust
passion
penchant
propensity
stomach
taste
thirst
weakness
willingness
yearning
zeal
zest
appetence
appetency
gluttony
hankering
itch
liking
proclivity
ravenousness
relish
urge
voracity
yen
appetition
big eyes
soft spot
sweet tooth
criticism
accusation
animadversion
arraignment
attack
attribution
castigation
censure
charge
chiding
complaint
denunciation
depreciation
diatribe
disapprobation
disapproval
disfavor
disparagement
expostulation
impeachment
implication
imputation
incrimination
inculpation
indictment
invective
objurgation
obloquy
opposition
rebuke
recrimination
remonstrance
reprehension
reprimand
reproach
reprobation
reproof
repudiation
slur
tirade
exprobation
absorption
combination
consolidation
application
assembly
centering
centralization
clustering
compression
concern
congregation
convergence
converging
debate
deliberation
fixing
focusing
heed
intensification
narrowing
need
single-mindedness
study
unity
amassing
bringing to bear
close attention
coalescing
compacting
flocking
huddling
massing
covet
cry out for
fancy
lust after
dream
need
require
suspire
want
ache for
die for
eat one's heart out
give eyeteeth for
hunger for
itch for
long for
pine for
sigh for
spoil for
thirst for
yearn for
yen for
demanding
analytical
belittling
biting
calumniatory
captious
carping
caviling
cavillous
censorious
censuring
choleric
condemning
critic
cutting
cynical
demeaning
derogatory
diagnostic
disapproving
discerning
discriminating
disparaging
exacting
exceptive
finicky
fussy
hairsplitting
humbling
hypercritical
lowering
nagging
niggling
nit-picking
overcritical
particular
penetrating
reproachful
sarcastic
satirical
scolding
severe
sharp
trenchant
withering
contingency
vicissitude
acuteness
constraint
crisis
crossroad
demand
dilemma
distress
duress
emergency
extremity
fix
hardship
imperativeness
jam
juncture
necessity
need
pass
pickle
pinch
plight
predicament
pressure
quandary
requirement
scrape
stress
urgency
want
wont
demandingness
exigence
needfulness
pressingness
turning point
zero hour
howl
lament
sob
bawl
bawling
bewailing
blubber
blubbering
howling
keening
lamentation
mourning
snivel
snivelling
sobbing
sorrowing
tears
wailing
weeping
whimpering
yowl
shedding tears
the blues
annoyed
bewildered
distracted
disturbed
embarrassed
fazed
flustered
nonplussed
perturbed
rattled
ruffled
thrown
troubled
unsettled
unzipped
upset
caught off balance
come apart
in botheration
messed-up
mixed-up
out of countenance
psyched-out
shook-up
spaced-out
taken aback
unglued
crestfallen
depressed
dismayed
pessimistic
beat
blue
dashed
daunted
deterred
dispirited
down
beat-down
caved-in
down in the mouth
downbeat
downcast
glum
gone to pieces
in a funk
in blue funk
in the dumps
lost momentum
sad
antipathy
aversion
dislike
distaste
hatred
loathing
repulsion
revulsion
abhorrence
abomination
detestation
hatefulness
nausea
objection
repugnance
revolt
satiation
satiety
sickness
surfeit
nauseation
nauseousness
inattention
indifference
lethargy
disregard
emotionlessness
impassivity
lassitude
listlessness
phlegm
unconcern
unresponsiveness
impassibility
incuriosity
incuriousness
uninterest
animosity
animus
antagonism
antipathy
aversion
disapproval
disgust
displeasure
dissatisfaction
distaste
enmity
hatred
hostility
loathing
prejudice
deprecation
detestation
disapprobation
disesteem
disfavor
disinclination
indisposition
objection
offense
opposition
repugnance
crestfallen
depressed
despondent
disheartened
glum
blue
discouraged
down
dragged
low
bummed out
disconsolate
downbeat
downcast
downhearted
funky
gloomy
in the doldrums
melancholy
morose
shot down
spiritless
woebegone
anger
annoyance
disapproval
dislike
dissatisfaction
distaste
indignation
irritation
pique
resentment
umbrage
unhappiness
aversion
disapprobation
discontentment
disfavor
disgruntlement
disinclination
indisposition
offense
vexation
wrath
disliking
disrelish
incensement
annoyance
anxiety
boredom
complaint
disappointment
disapproval
discomfort
discontent
dismay
displeasure
disquiet
distaste
exasperation
frustration
irritation
regret
resentment
uneasiness
unhappiness
weariness
worry
aversion
chagrin
desolation
discouragement
disfavor
disgruntlement
disinclination
dislike
distress
ennui
envy
fretfulness
heartburn
hopelessness
indisposition
lamentation
malcontent
oppression
querulousness
trouble
disliking
disrelish
malcontentment
antipathy
aversion
disgust
dislike
displeasure
dissatisfaction
hate
hatred
horror
hostility
loathing
repulsion
revulsion
abhorrence
detestation
disfavor
disinclination
indisposition
repugnance
revolt
disrelish
bankruptcy
breakdown
collapse
decline
defeat
deficiency
deterioration
failing
loss
misstep
abortion
bomb
botch
bungle
bust
checkmate
decay
deficit
downfall
fiasco
flop
frustration
implosion
inadequacy
lemon
loser
mess
misadventure
miscarriage
nonperformance
overthrow
rout
rupture
stalemate
stoppage
turkey
washout
wreck
false step
faux pas
flash in the pan
lead balloon
nonsuccess
sinking ship
total loss
lethargy
weakness
weariness
debility
dullness
enervation
ennui
exhaustion
faintness
feebleness
heaviness
languor
lassitude
listlessness
brain fag
burnout
fatigation
overtiredness
convicted
culpable
liable
remorseful
responsible
sorry
wrong
accusable
caught
censurable
censured
chargeable
condemned
conscience-stricken
contrite
convictable
criminal
damned
delinquent
depraved
doomed
erring
evil
felonious
hangdog
impeached
in error
in the wrong
incriminated
iniquitous
judged
licentious
offending
on one's head
out of line
proscribed
regretful
reprehensible
rueful
sentenced
sheepish
sinful
wicked
afraid
averse
doubtful
halting
indecisive
loath
reluctant
shy
skeptical
slow
tentative
timid
unsure
unwilling
backward
dawdling
delaying
diffident
disinclined
doubting
faltering
half-hearted
hanging back
hesitating
irresolute
lacking confidence
lazy
uneager
unpredictable
vacillating
wavering
desperate
forlorn
helpless
impossible
pointless
sad
tragic
useless
bad
beyond recall
cynical
dejected
demoralized
despairing
despondent
disconsolate
discouraging
downhearted
fatal
gone
goner
ill-fated
impracticable
in despair
incurable
irredeemable
irreparable
irreversible
irrevocable
lost
menacing
no-win
past hope
shot down
sinister
sunk
threatening
unachievable
unavailing
unfortunate
unmitigable
up the creek
vain
woebegone
worsening
doubtful
hesitant
tentative
wishy-washy
changeable
faltering
halting
hemming and hawing
hesitating
hot-and-cold
inconclusive
indeterminate
irresolute
of two minds
on the fence
unclear
undecided
undetermined
uneventful
unsettled
unstable
vacillating
waffling
wavering
weak-kneed
dawdling
delay
demurral
doubt
dubiety
equivocation
faltering
fluctuation
hesitancy
indecision
indisposition
irresoluteness
irresolution
misgiving
mistrust
oscillation
pause
procrastination
qualm
reluctance
scruple
skepticism
timidity
timidness
unwillingness
vacillation
wavering
averseness
delaying
fumbling
hemming and hawing
shilly-shally
stammering
stumbling
stuttering
tentativeness
to and fro
alienation
apathy
callousness
carelessness
disdain
disinterest
disregard
inattention
inertia
insensitivity
lack
negligence
nonchalance
aloofness
coldness
coolness
detachment
disinterestedness
dispassion
equity
heedlessness
immunity
impartiality
impassiveness
impassivity
insouciance
isolationism
lethargy
listlessness
neutrality
noninterference
objectivity
stoicism
torpor
unconcern
unmindfulness
cold shoulder
cold-bloodedness
inconsequential
infinitesimal
irrelevant
meager
meaningless
minimal
minor
minuscule
negligible
paltry
pointless
senseless
trivial
unimportant
casual
immaterial
inappreciable
inconsiderable
lesser
light
lightweight
little
minim
minute
nondescript
nonessential
not worth mentioning
nugatory
petty
purportless
scanty
secondary
small
trifling
unsubstantial
restlessness
indisposition
sleeplessness
stress
tension
vigil
vigilance
wakefulness
insomnolence
irritation
anger
annoyance
impatience
peevishness
annoyed
contentious
exasperated
fractious
petulant
prickly
resentful
surly
testy
bearish
brooding
cantankerous
carping
choleric
complaining
crabbed
cross
crotchety
disputatious
dissatisfied
dyspeptic
easily offended
fiery
fretful
fretting
gloomy
grouchy
grumbling
hasty
hot
huffy
hypercritical
ill-humored
irascible
moody
morose
out of humor
oversensitive
peevish
plaintive
querulous
quick-tempered
sensitive
snappy
snarling
tense
touchy
assassination
bloodshed
carnage
homicide
manslaughter
massacre
slaughter
slaying
execution
extermination
offing
bump off
bumping off
capital punishment
apathy
inertia
lethargy
negligence
sloth
weariness
dilatoriness
dormancy
dreaminess
drowsiness
dullness
faineance
heaviness
idleness
inactivity
indolence
inertness
laxness
leisureliness
listlessness
neglectfulness
passivity
remissness
slackness
sleepiness
slothfulness
slowness
sluggishness
stolidity
tardiness
torpidness
do-nothingness
faineancy
lackadaisicalness
languidness
languorousness
leadenness
otioseness
otiosity
supineness
torpescence
apathetic
careless
dull
inattentive
indifferent
lackadaisical
lethargic
passive
sleepy
tired
weary
asleep on the job
comatose
dallying
dilatory
drowsy
flagging
idle
indolent
inert
laggard
lagging
languid
languorous
lifeless
loafing
neglectful
out of it
procrastinating
remiss
shiftless
slack
slothful
slow
slow-moving
snoozy
somnolent
supine
tardy
torpid
trifling
unconcerned
unenergetic
unindustrious
unpersevering
unready
cynicism
despair
distrust
gloom
grief
hopelessness
melancholy
sadness
unhappiness
dejection
depression
despondency
dyspepsia
gloominess
glumness
dark side
dim view
expectation of worst
gloomy outlook
low spirits
absurd
aimless
fruitless
futile
impotent
inconsequential
ineffective
ineffectual
insignificant
irrelevant
meaningless
powerless
silly
stupid
trivial
unnecessary
unproductive
useless
worthless
around in circles
going nowhere
in vicious circle
inane
needle in haystack
nongermane
nonsensical
not pertinent
on treadmill
purportless
remote
unavailing
uninteresting
unprofitable
vague
vain
abuse
beating
discipline
forfeiture
retribution
sanction
suffering
torture
trial
amercement
castigation
chastening
chastisement
comeuppance
confiscation
correction
deprivation
forfeit
gallows
infliction
lumps
maltreatment
mortification
mulct
ostracism
pain
penance
proof
purgatory
reparation
rod
sequestration
unhappiness
victimization
disciplinary action
hard work
just desserts
punitive measures
rough treatment
short shrift
slave labor
what for
abhorrence
abomination
antipathy
aversion
denial
detestation
disgust
distaste
hate
hatred
horror
loathing
malice
rebuff
refusal
repugnance
resentment
revulsion
disrelish
repugnancy
snub
agitated
anxious
disturbed
edgy
fidgety
itchy
nervous
restive
sleepless
troubled
uneasy
unruly
unsettled
active
antsy
bundle of nerves
bustling
changeable
fidgeting
fitful
footloose
fretful
hurried
ill at ease
inconstant
intermittent
irresolute
jumpy
nomadic
on edge
perturbed
roving
spasmodic
strung-out
tossing and turning
transient
turbulent
unpeaceful
unquiet
unrestful
unstable
unsteady
wandering
worried
anguish
grief
heartache
heartbreak
hopelessness
melancholy
misery
mourning
poignancy
sorrow
blahs
bleakness
bummer
cheerlessness
dejection
despondency
disconsolateness
dispiritedness
distress
dolefulness
dolor
downer
dysphoria
forlornness
funk
gloominess
letdown
listlessness
moodiness
mopes
mournfulness
sorrowfulness
tribulation
woe
blue devils
blue funk
broken heart
dismals
downcastness
grieving
heavy heart
the blues
the dumps
ascetic
automatic
autogenous
automatous
autonomic
autonomous
endogenous
narcissistic
narcistic
subjective
sexuality
femininity
manhood
manliness
masculinity
womanhood
womanliness
coma
dream
hibernation
slumber
trance
bedtime
catnap
dormancy
doze
dullness
lethargy
nap
nod
repose
rest
sandman
shuteye
siesta
snooze
torpidity
torpor
few z's
forty winks
sack time
slumberland
dangerous
deadly
depressed
destructive
fatal
lethal
hara-kiri
mélange
self-destruction
self-immolation
self-slaughter
seppuku
fatigue
weariness
collapse
consumption
debilitation
debility
enervation
expenditure
feebleness
lassitude
prostration
burnout
afraid
anxious
apprehensive
hesitant
shaky
touchy
troubled
unsure
uptight
Delphic
choked
diffident
hanging by thread
jumpy
on thin ice
questioning
touch and go
unassured
unpoised
up in the air
vague
depressed
despondent
miserable
not happy
sorry
troubled
bleak
blue
bummed out
chapfallen
cheerless
crestfallen
dejected
destroyed
disconsolate
discouraged
dismal
dispirited
distressed
doleful
down
down and out
down in the mouth
downbeat
downcast
downhearted
dragged
dreary
forlorn
gloomy
grim
heavy-hearted
hurting
in a blue funk
in pain
in the dumps
let-down
long-faced
low
melancholy
mirthless
mournful
saddened
sorrowful
teary
barren
bogus
futile
inconsequential
ineffective
insignificant
meaningless
mediocre
pointless
unimportant
unproductive
unprofitable
unusable
useless
abandoned
abject
base
cheap
contemptible
counterproductive
despicable
empty
good-for-nothing
ignoble
ineffectual
inferior
inutile
miserable
no-account
no-good
nothing
nugatory
paltry
poor
profitless
sterile
trashy
trifling
trivial
unavailing
unessential
valueless
waste
wretched
impracticality
inadequacy
inefficiency
calm
harmony
order
peace
tranquility
calm
calmness
cheer
comfort
delight
ease
glee
good will
happiness
joy
kindness
liking
love
peace
pleasure
agreeability
contentment
enjoyment
good nature
pleasantness
calm
happy
mild
peaceful
pleased
collected
caring
compassionate
concerned
feeling
interested
sympathetic
responsive
apathy
disinclination
dislike
hate
hatred
indifference
lethargy
antipathy
aversion
disgust
distaste
loathing
repulsion
revulsion
acquittal
approval
commendation
compliment
endorsement
exculpation
exoneration
flattery
harmony
health
peace
praise
ratification
recommendation
retreat
sanction
applause
exaltation
thanks
division
parting
separation
severance
dispersal
scattering
dislike
have
abjure
hate
not want
spurn
complimentary
laudatory
praising
trivial
uncritical
unimportant
advantage
benefit
blessing
boon
calm
comfort
ease
good
good fortune
miracle
peace
pleasure
plenty
solution
laugh
happy
settled
calm
composed
concerted
soothed
unworried
encouraged
heartened
inspired
approval
liking
love
loving
admiration
appeal
desire
esteem
fondness
respect
reverence
admiration
approval
desire
esteem
fondness
friendship
good will
happiness
kindness
liking
love
loving
pleasure
regard
respect
satisfaction
sympathy
cheerful
elated
encouraged
happy
heartened
enthused
inspirited
approval
happiness
joy
liking
love
pleasure
kindness
calm
composure
delight
satisfaction
approval
assurance
calm
calmness
comfort
composure
contentedness
delight
ease
encouragement
happiness
love
peace
pleasure
sanction
satisfaction
advantage
cheer
enthusiasm
incentive
joy
kindness
liking
contentment
admiration
delight
esteem
fondness
happiness
kindness
liking
love
loving
pleasure
respect
satisfaction
sympathy
desire
betterment
improvement
increase
rise
success
win
accomplishment
benefit
blessing
continuation
enough
plenty
triumph
achievement
achiever
attainment
earnings
gain
merit
ability
energy
health
liveliness
strength
vigor
freshness
spirit
good
immune
irresponsible
right
guiltless
innocent
moral
sinless
truthful
believing
bold
brave
certain
confident
decisive
definite
eager
extroverted
fearless
ready
sure
willing
resolute
unhesitant
unwavering
cheerful
good
happy
hopeful
joyful
auspicious
bright
encouraging
expectant
optimistic
promising
propitious
rosy
certain
definite
sure
decisive
deliberate
determined
belief
certainty
confidence
faith
trust
attention
esteem
respect
bias
caring
compassion
concern
feeling
interest
involvement
regard
sympathy
big
huge
important
large
major
meaningful
relevant
sensible
significant
substantial
useful
valuable
worthwhile
consequential
relaxation
sleep
enjoyment
happiness
joy
happy
pleasant
cheerful
nice
birth
activity
life
liveliness
action
diligence
hard work
industriousness
industry
activated
active
attentive
careful
caring
concerned
energetic
fresh
interested
lively
vivacious
diligent
hard-working
industrious
cheer
confidence
faith
happiness
joy
joyfulness
trust
optimism
able
consequential
effective
fruitful
important
necessary
potent
productive
profitable
sensible
significant
strong
useful
valuable
wise
worthwhile
beneficial
meaningful
pointed
award
happiness
reward
indulgence
encouragement
exoneration
praise
protection
fondness
liking
partiality
predilection
preference
taste
attraction
calm
collected
composed
content
cool
easygoing
laid-back
peaceful
quiet
relaxed
settled
unworried
cheer
delight
happiness
joy
advantage
benefit
comfort
gladness
other
abstention
chastity
consciousness
wakefulness
action
activity
energy
liveliness
awakening
harmless
healthful
helpful
life-giving
wholesome
ability
health
strength
at ease
calm
certain
collected
composed
cool
definite
happy
peaceful
quiet
sure
unafraid
unwavering
unworried
confident
guarded
protected
safe
secure
sound
cheerful
elated
happy
hopeful
joyful
glad
joyous
beneficial
fruitful
helpful
important
meaningful
productive
profitable
significant
useful
valuable
worthwhile
worthy
worth
agitation
anger
angry
apathetic
appetite
blame
concentration
crave
critical
criticalness
cry
disconcerted
discouraged
disgust
disinterest
dislike
dispirited
displeasure
dissatisfaction
distaste
failure
fatigue
guilty
hesitant
hopeless
indecisive
indecisiveness
indifference
insignificant
insomnia
irritability
irritable
killing
laziness
lazy
pessimism
pointless
punishment
repulsion
restless
sadness
self
sex
sleep
suicidal
suicide
tiredness
unconfident
unhappy
worthless
worthlessness
