disturbance
turbulence
turmoil
unrest
upheaval
calm
harmony
order
peace
tranquility
callous
indifferent
laid-back
passive
stoic
uninterested
caring
compassionate
concerned
feeling
interested
sympathetic
craving
demand
fondness
greed
hunger
inclination
longing
lust
passion
penchant
propensity
stomach
taste
thirst
weakness
willingness
yearning
zeal
zest
apathy
disinclination
dislike
hate
hatred
indifference
lethargy
absorption
combination
consolidation
division
parting
separation
severance
demanding
contingency
vicissitude
howl
lament
sob
laugh
inattention
indifference
lethargy
animosity
animus
antagonism
antipathy
aversion
disapproval
disgust
displeasure
dissatisfaction
distaste
enmity
hatred
hostility
loathing
prejudice
admiration
approval
desire
esteem
fondness
friendship
good will
happiness
kindness
liking
love
loving
pleasure
regard
respect
satisfaction
sympathy
crestfallen
depressed
despondent
disheartened
glum
cheerful
elated
encouraged
happy
anger
annoyance
disapproval
dislike
dissatisfaction
distaste
indignation
irritation
pique
resentment
umbrage
unhappiness
approval
happiness
joy
liking
love
pleasure
annoyance
anxiety
boredom
complaint
disappointment
disapproval
discomfort
discontent
dismay
displeasure
disquiet
distaste
exasperation
frustration
irritation
regret
resentment
uneasiness
unhappiness
weariness
worry
approval
assurance
calm
calmness
comfort
composure
contentedness
delight
ease
encouragement
happiness
love
peace
pleasure
sanction
satisfaction
bankruptcy
breakdown
collapse
decline
defeat
deficiency
deterioration
failing
loss
misstep
betterment
improvement
increase
rise
success
win
lethargy
weakness
weariness
convicted
culpable
liable
remorseful
responsible
sorry
wrong
good
immune
irresponsible
right
doubtful
hesitant
tentative
wishy-washy
certain
definite
sure
irritation
cynicism
despair
distrust
gloom
grief
hopelessness
melancholy
sadness
unhappiness
cheer
confidence
faith
happiness
joy
joyfulness
trust
abuse
beating
discipline
forfeiture
retribution
sanction
suffering
torture
trial
award
happiness
reward
anguish
grief
heartache
heartbreak
hopelessness
melancholy
misery
mourning
poignancy
sorrow
cheer
delight
happiness
joy
sexuality
coma
dream
hibernation
slumber
trance
consciousness
wakefulness
dangerous
deadly
depressed
destructive
fatal
lethal
harmless
healthful
helpful
life-giving
wholesome
fatigue
weariness
barren
bogus
futile
inconsequential
ineffective
insignificant
meaningless
mediocre
pointless
unimportant
unproductive
unprofitable
unusable
useless
beneficial
fruitful
helpful
important
meaningful
productive
profitable
significant
useful
valuable
worthwhile
agitation
apathetic
appetite
concentration
critical
criticalness
cry
disconcerted
disinterest
dislike
dispirited
displeasure
dissatisfaction
failure
fatigue
guilty
indecisive
indecisiveness
irritability
pessimism
punishment
sadness
self
sex
sleep
suicidal
tiredness
worthless
worthlessness
