disturbance
turbulence
turmoil
unrest
upheaval
commotion
discomposure
stirring
tizzy
churning
rocking
tossing
callous
indifferent
laid-back
passive
stoic
uninterested
blah
cold
cool
could care less
couldn't care less
don't give a damn
draggy
emotionless
flat
impassive
insensible
languid
moony
stolid
unconcerned
unemotional
unfeeling
unmoved
unresponsive
untouched
what the hell
wimpy
craving
demand
fondness
greed
hunger
inclination
longing
lust
passion
penchant
propensity
stomach
taste
thirst
weakness
willingness
yearning
zeal
zest
appetence
appetency
gluttony
hankering
itch
liking
proclivity
ravenousness
relish
urge
voracity
yen
appetition
big eyes
soft spot
sweet tooth
absorption
combination
consolidation
application
assembly
centering
centralization
clustering
compression
concern
congregation
convergence
converging
debate
deliberation
fixing
focusing
heed
intensification
narrowing
need
single-mindedness
study
unity
amassing
bringing to bear
close attention
coalescing
compacting
flocking
huddling
massing
demanding
analytical
belittling
biting
calumniatory
captious
carping
caviling
cavillous
censorious
censuring
choleric
condemning
critic
cutting
cynical
demeaning
derogatory
diagnostic
disapproving
discerning
discriminating
disparaging
exacting
exceptive
finicky
fussy
hairsplitting
humbling
hypercritical
lowering
nagging
niggling
nit-picking
overcritical
particular
penetrating
reproachful
sarcastic
satirical
scolding
severe
sharp
trenchant
withering
contingency
vicissitude
acuteness
constraint
crisis
crossroad
demand
dilemma
distress
duress
emergency
extremity
fix
hardship
imperativeness
jam
juncture
necessity
need
pass
pickle
pinch
plight
predicament
pressure
quandary
requirement
scrape
stress
urgency
want
wont
demandingness
exigence
needfulness
pressingness
turning point
zero hour
howl
lament
sob
bawl
bawling
bewailing
blubber
blubbering
howling
keening
lamentation
mourning
snivel
snivelling
sobbing
sorrowing
tears
wailing
weeping
whimpering
yowl
shedding tears
the blues
annoyed
bewildered
distracted
disturbed
embarrassed
fazed
flustered
nonplussed
perturbed
rattled
ruffled
thrown
troubled
unsettled
unzipped
upset
caught off balance
come apart
in botheration
messed-up
mixed-up
out of countenance
psyched-out
shook-up
spaced-out
taken aback
unglued
inattention
indifference
lethargy
disregard
emotionlessness
impassivity
lassitude
listlessness
phlegm
unconcern
unresponsiveness
impassibility
incuriosity
incuriousness
uninterest
animosity
animus
antagonism
antipathy
aversion
disapproval
disgust
displeasure
dissatisfaction
distaste
enmity
hatred
hostility
loathing
prejudice
deprecation
detestation
disapprobation
disesteem
disfavor
disinclination
indisposition
objection
offense
opposition
repugnance
crestfallen
depressed
despondent
disheartened
glum
blue
discouraged
down
dragged
low
bummed out
disconsolate
downbeat
downcast
downhearted
funky
gloomy
in the doldrums
melancholy
morose
shot down
spiritless
woebegone
anger
annoyance
disapproval
dislike
dissatisfaction
distaste
indignation
irritation
pique
resentment
umbrage
unhappiness
aversion
disapprobation
discontentment
disfavor
disgruntlement
disinclination
indisposition
offense
vexation
wrath
disliking
disrelish
incensement
annoyance
anxiety
boredom
complaint
disappointment
disapproval
discomfort
discontent
dismay
displeasure
disquiet
distaste
exasperation
frustration
irritation
regret
resentment
uneasiness
unhappiness
weariness
worry
aversion
chagrin
desolation
discouragement
disfavor
disgruntlement
disinclination
dislike
distress
ennui
envy
fretfulness
heartburn
hopelessness
indisposition
lamentation
malcontent
oppression
querulousness
trouble
disliking
disrelish
malcontentment
bankruptcy
breakdown
collapse
decline
defeat
deficiency
deterioration
failing
loss
misstep
abortion
bomb
botch
bungle
bust
checkmate
decay
deficit
downfall
fiasco
flop
frustration
implosion
inadequacy
lemon
loser
mess
misadventure
miscarriage
nonperformance
overthrow
rout
rupture
stalemate
stoppage
turkey
washout
wreck
false step
faux pas
flash in the pan
lead balloon
nonsuccess
sinking ship
total loss
lethargy
weakness
weariness
debility
dullness
enervation
ennui
exhaustion
faintness
feebleness
heaviness
languor
lassitude
listlessness
brain fag
burnout
fatigation
overtiredness
convicted
culpable
liable
remorseful
responsible
sorry
wrong
accusable
caught
censurable
censured
chargeable
condemned
conscience-stricken
contrite
convictable
criminal
damned
delinquent
depraved
doomed
erring
evil
felonious
hangdog
impeached
in error
in the wrong
incriminated
iniquitous
judged
licentious
offending
on one's head
out of line
proscribed
regretful
reprehensible
rueful
sentenced
sheepish
sinful
wicked
doubtful
hesitant
tentative
wishy-washy
changeable
faltering
halting
hemming and hawing
hesitating
hot-and-cold
inconclusive
indeterminate
irresolute
of two minds
on the fence
unclear
undecided
undetermined
uneventful
unsettled
unstable
vacillating
waffling
wavering
weak-kneed
dawdling
delay
demurral
doubt
dubiety
equivocation
faltering
fluctuation
hesitancy
indecision
indisposition
irresoluteness
irresolution
misgiving
mistrust
oscillation
pause
procrastination
qualm
reluctance
scruple
skepticism
timidity
timidness
unwillingness
vacillation
wavering
averseness
delaying
fumbling
hemming and hawing
shilly-shally
stammering
stumbling
stuttering
tentativeness
to and fro
irritation
anger
annoyance
impatience
peevishness
cynicism
despair
distrust
gloom
grief
hopelessness
melancholy
sadness
unhappiness
dejection
depression
despondency
dyspepsia
gloominess
glumness
dark side
dim view
expectation of worst
gloomy outlook
low spirits
abuse
beating
discipline
forfeiture
retribution
sanction
suffering
torture
trial
amercement
castigation
chastening
chastisement
comeuppance
confiscation
correction
deprivation
forfeit
gallows
infliction
lumps
maltreatment
mortification
mulct
ostracism
pain
penance
proof
purgatory
reparation
rod
sequestration
unhappiness
victimization
disciplinary action
hard work
just desserts
punitive measures
rough treatment
short shrift
slave labor
what for
anguish
grief
heartache
heartbreak
hopelessness
melancholy
misery
mourning
poignancy
sorrow
blahs
bleakness
bummer
cheerlessness
dejection
despondency
disconsolateness
dispiritedness
distress
dolefulness
dolor
downer
dysphoria
forlornness
funk
gloominess
letdown
listlessness
moodiness
mopes
mournfulness
sorrowfulness
tribulation
woe
blue devils
blue funk
broken heart
dismals
downcastness
grieving
heavy heart
the blues
the dumps
ascetic
automatic
autogenous
automatous
autonomic
autonomous
endogenous
narcissistic
narcistic
subjective
sexuality
femininity
manhood
manliness
masculinity
womanhood
womanliness
coma
dream
hibernation
slumber
trance
bedtime
catnap
dormancy
doze
dullness
lethargy
nap
nod
repose
rest
sandman
shuteye
siesta
snooze
torpidity
torpor
few z's
forty winks
sack time
slumberland
dangerous
deadly
depressed
destructive
fatal
lethal
fatigue
weariness
collapse
consumption
debilitation
debility
enervation
expenditure
feebleness
lassitude
prostration
burnout
barren
bogus
futile
inconsequential
ineffective
insignificant
meaningless
mediocre
pointless
unimportant
unproductive
unprofitable
unusable
useless
abandoned
abject
base
cheap
contemptible
counterproductive
despicable
empty
good-for-nothing
ignoble
ineffectual
inferior
inutile
miserable
no-account
no-good
nothing
nugatory
paltry
poor
profitless
sterile
trashy
trifling
trivial
unavailing
unessential
valueless
waste
wretched
impracticality
inadequacy
inefficiency
calm
harmony
order
peace
tranquility
caring
compassionate
concerned
feeling
interested
sympathetic
responsive
apathy
disinclination
dislike
hate
hatred
indifference
lethargy
antipathy
aversion
disgust
distaste
loathing
repulsion
revulsion
division
parting
separation
severance
dispersal
scattering
complimentary
laudatory
praising
trivial
uncritical
unimportant
advantage
benefit
blessing
boon
calm
comfort
ease
good
good fortune
miracle
peace
pleasure
plenty
solution
laugh
happy
settled
calm
composed
concerted
soothed
unworried
admiration
approval
desire
esteem
fondness
friendship
good will
happiness
kindness
liking
love
loving
pleasure
regard
respect
satisfaction
sympathy
cheerful
elated
encouraged
happy
heartened
enthused
inspirited
approval
happiness
joy
liking
love
pleasure
kindness
calm
composure
delight
satisfaction
approval
assurance
calm
calmness
comfort
composure
contentedness
delight
ease
encouragement
happiness
love
peace
pleasure
sanction
satisfaction
advantage
cheer
enthusiasm
incentive
joy
kindness
liking
contentment
betterment
improvement
increase
rise
success
win
accomplishment
benefit
blessing
continuation
enough
plenty
triumph
achievement
achiever
attainment
earnings
gain
merit
ability
energy
health
liveliness
strength
vigor
freshness
spirit
good
immune
irresponsible
right
guiltless
innocent
moral
sinless
truthful
certain
definite
sure
decisive
deliberate
determined
belief
certainty
confidence
faith
trust
enjoyment
happiness
joy
cheer
confidence
faith
happiness
joy
joyfulness
trust
optimism
award
happiness
reward
indulgence
encouragement
exoneration
praise
protection
cheer
delight
happiness
joy
advantage
benefit
comfort
gladness
other
abstention
chastity
consciousness
wakefulness
action
activity
energy
liveliness
awakening
harmless
healthful
helpful
life-giving
wholesome
ability
health
strength
beneficial
fruitful
helpful
important
meaningful
productive
profitable
significant
useful
valuable
worthwhile
worthy
worth
agitation
apathetic
appetite
concentration
critical
criticalness
cry
disconcerted
disinterest
dislike
dispirited
displeasure
dissatisfaction
failure
fatigue
guilty
indecisive
indecisiveness
irritability
pessimism
punishment
sadness
self
sex
sleep
suicidal
tiredness
worthless
worthlessness
